int/resources/objectRepo/xmlTemplates/htng/HTNG2008BExt/req_UpdateRoomStatus.xml

<soapenv:Envelope xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://webservices.micros.com/htng/2008B/SingleGuestItinerary/Housekeeping/Types" xmlns:typ1="http://htng.org/PWS/2008B/SingleGuestItinerary/Common/Types">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:UpdateRoomStatusRequest>
         <typ:ResortId></typ:ResortId>
         <typ:RoomNumber></typ:RoomNumber>
         <typ:RoomStatus></typ:RoomStatus>
         <typ:TurnDownStatus></typ:TurnDownStatus>
         <typ:GuestServiceStatus></typ:GuestServiceStatus>
         <typ:RoomRepair>
            <typ:RepairDate>
               <typ1:Start></typ1:Start>
               <typ1:End></typ1:End>
            </typ:RepairDate>
            <typ:ReturnStatus></typ:ReturnStatus>
            <typ:RepairStatus></typ:RepairStatus>
            <typ:RepairReason></typ:RepairReason>
            <typ:RepairType></typ:RepairType>
            <typ:RepairRemarks></typ:RepairRemarks>
         </typ:RoomRepair>
         <typ:FOStatus></typ:FOStatus>
         <typ:Attendant>
            <typ:AttendantName></typ:AttendantName>
            <typ:AttendantId source="?"></typ:AttendantId>
            <typ:InTime></typ:InTime>
            <typ:OutTime></typ:OutTime>
         </typ:Attendant>
         <typ:HKStatus></typ:HKStatus>
      </typ:UpdateRoomStatusRequest>
   </soapenv:Body>
</soapenv:Envelope>
